; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image5 - mode
	thermograph4 - mode
	spectrograph3 - mode
	thermograph0 - mode
	image2 - mode
	spectrograph1 - mode
	Star2 - direction
	Star5 - direction
	GroundStation6 - direction
	Star12 - direction
	Star4 - direction
	GroundStation9 - direction
	Star1 - direction
	Star11 - direction
	Star10 - direction
	Star0 - direction
	Star8 - direction
	Star7 - direction
	GroundStation3 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(supports instrument2 image5)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument3 spectrograph1)
	(supports instrument3 image5)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Planet13)
	(have_image Planet13 image2)
	(have_image Planet13 thermograph0)
	(have_image Planet14 spectrograph1)
	(have_image Planet14 spectrograph3)
	(have_image Phenomenon15 spectrograph3)
	(have_image Phenomenon15 spectrograph1)
	(have_image Phenomenon16 image5)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (turn_to satellite1 phenomenon15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 9
4. (turn_to satellite0 planet13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet13)
   goals met: 0 of 9
5. (turn_to satellite1 star8 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star8)
   goals met: 0 of 9
6. (calibrate satellite1 instrument3 star8)
   added: (calibrated instrument3)
   goals met: 0 of 9
7. (turn_to satellite1 phenomenon15 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 9
8. (take_image satellite1 phenomenon15 instrument3 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 1 of 9
9. (take_image satellite1 phenomenon15 instrument3 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 2 of 9
10. (turn_to satellite1 phenomenon16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 9
11. (take_image satellite1 phenomenon16 instrument3 image5)
   added: (have_image phenomenon16 image5)
   goals met: 3 of 9
12. (turn_to satellite1 planet13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet13)
   goals met: 4 of 9
13. (take_image satellite1 planet13 instrument3 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 5 of 9
14. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 4 of 9
15. (take_image satellite1 planet14 instrument3 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 5 of 9
16. (take_image satellite1 planet14 instrument3 spectrograph3)
   added: (have_image planet14 spectrograph3)
   goals met: 6 of 9
17. (turn_to satellite1 planet13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet13)
   goals met: 7 of 9
18. (turn_to satellite0 star11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star11)
   goals met: 7 of 9
19. (calibrate satellite0 instrument1 star11)
   added: (calibrated instrument1)
   goals met: 7 of 9
20. (turn_to satellite0 planet13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet13)
   goals met: 7 of 9
21. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 8 of 9
22. (turn_to satellite0 star2 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star2)
   goals met: 9 of 9
